In [6]:
##Dataframe

##Creating Dataframe
##using dictionaries of series

import pandas as pd
company_list = {'INFOSYS': pd.Series([346.15,0.59,459,0.52,589.8,158.88]),'TCS': pd.Series([1133.43,36.05,335.83,0.87,31.44,380.64])}
companydf = pd.DataFrame(company_list)
companydf

   INFOSYS      TCS
0   346.15  1133.43
1     0.59    36.05
2   459.00   335.83
3     0.52     0.87
4   589.80    31.44
5   158.88   380.64

In [4]:
companydf.index

Index(['Closing price', 'EPS', 'Shares Outstanding(M)', 'Beta', 'P/E',
       'Market Cap(B)'],
      dtype='object')

In [44]:
companydf_1 = pd.DataFrame(company_list,index=['Closing price','EPS','Shares Outstanding(M)','P/E', 'Market Cap(B)','Beta'])
companydf_1

                       INFOSYS      TCS
Closing price           346.15  1133.43
EPS                       0.59    36.05
Shares Outstanding(M)   459.00   335.83
P/E                     589.80    31.44
Market Cap(B)           158.88   380.64
Beta                      0.52     0.87

In [45]:
companydf_2 = pd.DataFrame(company_list,index=['Closing price','EPS','Shares Outstanding(M)','P/E', 'Market Cap(B)','Beta'],columns=['INFOSYS'])
companydf_2

                       INFOSYS
Closing price           346.15
EPS                       0.59
Shares Outstanding(M)   459.00
P/E                     589.80
Market Cap(B)           158.88
Beta                      0.52

In [46]:
companydf_1.index

Index(['Closing price', 'EPS', 'Shares Outstanding(M)', 'P/E', 'Market Cap(B)',
       'Beta'],
      dtype='object')

In [47]:
companydf_1.columns

Index(['INFOSYS', 'TCS'], dtype='object')

In [4]:
#Using Dictionaries of series

summary_stockdat ={'INFOSYS': pd.Series([346.15,0.59,459,0.52,589.8,158.88],index=['Closing price','EPS','Shares Outstanding(M)','Beta','P/E', 'Market Cap(B)']),
                   'TCS': pd.Series([1133.43,36.05,335.83,0.87,31.44,380.64],index=['Closing price','EPS','Shares Outstanding(M)','Beta','P/E', 'Market Cap(B)'])}

DF_stocksummary=pd.DataFrame(summary_stockdat)
DF_stocksummary

                       INFOSYS      TCS
Closing price           346.15  1133.43
EPS                       0.59    36.05
Shares Outstanding(M)   459.00   335.83
Beta                      0.52     0.87
P/E                     589.80    31.44
Market Cap(B)           158.88   380.64

In [5]:
##Access row_index labels

DF_stocksummary.index

Index(['Closing price', 'EPS', 'Shares Outstanding(M)', 'Beta', 'P/E',
       'Market Cap(B)'],
      dtype='object')

In [6]:
##Access column labels

DF_stocksummary.columns

Index(['INFOSYS', 'TCS'], dtype='object')

In [50]:
#Using Dictionary of ndarrays/lists

ml_algorithms = {'classification': ['kNN','Decision Trees'],
                 'Regression': ['Linear','Logistic'],
                 'clustering': ['Hierarchial','k-means']}
ml_algorithms

{'Regression': ['Linear', 'Logistic'],
 'classification': ['kNN', 'Decision Trees'],
 'clustering': ['Hierarchial', 'k-means']}

In [51]:
df1 = pd.DataFrame(ml_algorithms)
df1

  Regression  classification   clustering
0     Linear             kNN  Hierarchial
1   Logistic  Decision Trees      k-means

In [53]:
df1 = pd.DataFrame(ml_algorithms,index = ['alg_1','alg_2'])
df1

      Regression  classification   clustering
alg_1     Linear             kNN  Hierarchial
alg_2   Logistic  Decision Trees      k-means

In [76]:
##using a structured array

class_data = np.zeros((4,), dtype=[('Name','U25'),
                       ('Gender','U10'),
                      ('Present/Absent','U15')])
class_data

array([('', '', ''), ('', '', ''), ('', '', ''), ('', '', '')],
      dtype=[('Name', '<U25'), ('Gender', '<U10'), ('Present/Absent', '<U15')])

In [77]:
class_data[:] = [('Ram','Male','Present'),('sita','Female','Absent'),('Yashoda','Female','Present'),('Tom','Male','Present')]
class_data

array([('Ram', 'Male', 'Present'), ('sita', 'Female', 'Absent'),
       ('Yashoda', 'Female', 'Present'), ('Tom', 'Male', 'Present')],
      dtype=[('Name', '<U25'), ('Gender', '<U10'), ('Present/Absent', '<U15')])

In [78]:
class_df = pd.DataFrame(class_data)
class_df

      Name  Gender Present/Absent
0      Ram    Male        Present
1     sita  Female         Absent
2  Yashoda  Female        Present
3      Tom    Male        Present

In [79]:
##using a series structure

df_3 = pd.DataFrame(series_1)
df_3

                           0
Australia  australian dollar
France                  euro
Germany                 euro
India                  Rupee
Japan                    yen
UK                     pound
US                    dollar

In [81]:
##Operations on Dataframes

#Selection

class_df['Name']

0        Ram
1       sita
2    Yashoda
3        Tom
Name: Name, dtype: object

In [84]:
##Assignment

class_df['Marks'] = 80
class_df

      Name  Gender Present/Absent  Marks
0      Ram    Male        Present     80
1     sita  Female         Absent     80
2  Yashoda  Female        Present     80
3      Tom    Male        Present     80

In [83]:
##Deletion

del class_df['Marks']
class_df

      Name  Gender Present/Absent
0      Ram    Male        Present
1     sita  Female         Absent
2  Yashoda  Female        Present
3      Tom    Male        Present

In [86]:
class_df.pop('Marks')
class_df

      Name  Gender Present/Absent
0      Ram    Male        Present
1     sita  Female         Absent
2  Yashoda  Female        Present
3      Tom    Male        Present

In [88]:
##Insert at specific column

class_df.insert(2,'Age',30);
class_df

      Name  Gender  Age Present/Absent
0      Ram    Male   30        Present
1     sita  Female   30         Absent
2  Yashoda  Female   30        Present
3      Tom    Male   30        Present

In [89]:
##Alignment

ex_df1=pd.DataFrame(np.array([[20,35,25,20],[11,28,32,29]]),columns=['Marks1','Marks2','Marks3','Marks4'])
ex_df1

   Marks1  Marks2  Marks3  Marks4
0      20      35      25      20
1      11      28      32      29

In [90]:
ex_df2=pd.DataFrame(np.array([[11,12,13,14],[15,16,17,18]]),columns=['Marks1','Marks5','Marks3','Marks4'])
ex_df2

   Marks1  Marks5  Marks3  Marks4
0      11      12      13      14
1      15      16      17      18

In [91]:
ex_df3 = ex_df1 +ex_df2
ex_df3

   Marks1  Marks2  Marks3  Marks4  Marks5
0      31     NaN      38      34     NaN
1      26     NaN      49      47     NaN